Revit 2027 API
IFCCategoryTemplate.IsValidCategoryMappingFile Property
 Whether or not the category mapping file is valid.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsValidCategoryMappingFile { get; set; }
Public Property IsValidCategoryMappingFile As Boolean
	Get
	Set
public:
property bool IsValidCategoryMappingFile {
	bool get ();
	void set (bool value);
}
member IsValidCategoryMappingFile : bool with get, set
Property Value
Boolean
See Also
Reference
IFCCategoryTemplate Class
Autodesk.Revit.DB Namespace